"""
  Длина Московской кольцевой автомобильной дороги —109 километров.
  Стартуем с нулевого километра МКАД и едем со скоростью V километров в час.
  На какой отметке остановимся через T часов?
  Программа получает на вход значение V и T.
  Если V>0, то движемся в положительном направлении по МКАД, если же значение V<0, то в отрицательном.
  Программа должна вывести целое число от 0 до 108 — номер отметки, на которой остановимся.
  
  Выполнил Зикунов Семён
"""
v = int(input("Введите скорость "))
t = int(input("Введите время "))
#count = 0
#flag = True

if v < 0:
    #flag = False
    v = abs(v)
s= v*t
if s < 108:
    #print("Отметка", s)
    print(s)
elif s==109:
    s=s-109
elif s>109:
    while True:
        s=s - 109

        #count = count+1

        if s > 109:
            continue
        elif s < 109:
            break
        elif s == 0:

            #count=count+1

            break
#print("Отметка", s)

print(s)

#print("Кругов", count)
#if flag==False:
   # print("Вы двигались в отрицательном направлении")
